In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/bhanu/Downloads/employee_productivity_normal_clean_3000.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Employee_ID             3000 non-null   object
 1   Age                     3000 non-null   int64
 2   Gender                  3000 non-null   object
 3   Department              3000 non-null   object
 4   Region                  3000 non-null   object
 5   Experience_Years        3000 non-null   float64
 6   Education_Level         3000 non-null   int64
 7   Salary_INR              3000 non-null   int64
 8   Training_Hours          3000 non-null   float64
 9   Performance_Score       3000 non-null   float64
 10  Job_Satisfaction_Score  3000 non-null   float64
 11  Promoted_Last_3_Years   3000 non-null   object
 12  Attrition_Status        3000 non-null   object
 13  Team_ID                 3000 non-null   object
 14  Join_Date               3000 non-null   object
dtypes: float64(4), int64(3), object(8)
memory usage: 351.7+ KB

### gender and salary

In [10]:
male_sal = df[df['Gender']=='Male']['Salary_INR']

In [11]:
male_sal

0        57718
2        61159
6        73577
8       102801
11       88931
         ...
2990    112021
2991     97837
2993     43734
2996    103344
2998     66300
Name: Salary_INR, Length: 1578, dtype: int64

In [12]:
female_sal = df[df['Gender']=='Female']['Salary_INR']

In [13]:
female_sal

1        67381
3        69040
4        75717
5        96743
7        48287
         ...
2992     76907
2994     79614
2995     82033
2997    111769
2999     96024
Name: Salary_INR, Length: 1422, dtype: int64

In [15]:
from scipy import stats
import numpy as np

In [17]:
from scipy.stats import ttest_ind


t_test,p_value =ttest_ind(male_sal,female_sal,equal_var=False)

In [19]:
if p_value < 0.05:
    print("Reject H₀ → Attrition depends on Gender (significant relationship")
else:
    print("Fail to Reject H₀ → Attrition independent of Gender")

Fail to Reject H₀ → Attrition independent of Gender

### gender and performance

In [23]:
female_performane = df[df['Gender']=='Female']['Performance_Score']

In [24]:
female_performane

1       47.5
3       69.5
4       70.2
5       72.2
7       69.6
        ...
2992    72.5
2994    66.4
2995    59.1
2997    85.7
2999    68.2
Name: Performance_Score, Length: 1422, dtype: float64

In [25]:
male_performsnce  = df[df['Gender']=='Male']['Performance_Score']

In [26]:
male_performsnce

0       84.1
2       66.1
6       77.3
8       65.6
11      79.5
        ...
2990    86.2
2991    81.0
2993    72.9
2996    84.8
2998    59.4
Name: Performance_Score, Length: 1578, dtype: float64

In [27]:
t_test,p_value = ttest_ind(male_performsnce,female_performane,equal_var=False)

In [28]:
if p_value < 0.05:
    print("Reject H₀ ")
else:
    print("Fail to Reject H₀")

Fail to Reject H₀

### gender and attrition_status

In [29]:
contingency = pd.crosstab(df['Gender'], df['Attrition_Status'])

chi2_stat, p_val, dof, expected = stats.chi2_contingency(contingency)

print(f"Chi2 Statistic: {chi2_stat:.4f}, P-value: {p_val:.4f}")

if p_val < 0.05:
    print("Reject H₀ → Attrition depends on Gender (significant relationship).\n")
else:
    print("Fail to Reject H₀ → Attrition independent of Gender.\n")

Chi2 Statistic: 1.0203, P-value: 0.3124
Fail to Reject H₀ → Attrition independent of Gender.

In [30]:
contingency

Attrition_Status    No  Yes
Gender
Female            1153  269
Male              1303  275

In [31]:
expected

array([[1164.144,  257.856],
       [1291.856,  286.144]])

In [33]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### department and salary

In [54]:
groups_salary = [df[df['Department'] == dept]['Salary_INR'] for dept in df['Department'].unique()]

In [55]:
groups_salary

[0       57718
 1       67381
 2       61159
 3       69040
 5       96743
         ...
 2975    61731
 2987    67717
 2989    71101
 2991    97837
 2998    66300
 Name: Salary_INR, Length: 1083, dtype: int64,
 4        75717
 8       102801
 9        63258
 36       97251
 45       71671
          ...
 2983     96528
 2984     75493
 2985    113333
 2986     66433
 2993     43734
 Name: Salary_INR, Length: 585, dtype: int64,
 6        73577
 12       83992
 15       62774
 18       77053
 19       99279
          ...
 2981    107382
 2994     79614
 2996    103344
 2997    111769
 2999     96024
 Name: Salary_INR, Length: 559, dtype: int64,
 10       78826
 22      129844
 28       40689
 29       68258
 33       62185
          ...
 2968     90674
 2980     73855
 2982     78026
 2992     76907
 2995     82033
 Name: Salary_INR, Length: 448, dtype: int64,
 16      123571
 17       83887
 20       84989
 23       74498
 31       71503
          ...
 2948     86655
 2969    109859
 2971    109590
 2988    110490
 2990    112021
 Name: Salary_INR, Length: 325, dtype: int64]

In [56]:
f_stat_salary, p_salary = stats.f_oneway(*groups_salary)
print(f"F-statistic: {f_stat_salary:.4f}, p-value: {p_salary:.4f}\n")

F-statistic: 0.5478, p-value: 0.7006

### department and performance

In [58]:
groups_salary = [df[df['Department'] == dept]['Performance_Score'] for dept in df['Department'].unique()]

In [59]:
groups_salary

[0       84.1
 1       47.5
 2       66.1
 3       69.5
 5       72.2
         ...
 2975    66.0
 2987    82.4
 2989    66.2
 2991    81.0
 2998    59.4
 Name: Performance_Score, Length: 1083, dtype: float64,
 4        70.2
 8        65.6
 9        65.1
 36       66.9
 45       73.0
         ...
 2983    100.0
 2984     50.2
 2985     70.1
 2986     83.7
 2993     72.9
 Name: Performance_Score, Length: 585, dtype: float64,
 6       77.3
 12      62.2
 15      63.7
 18      77.7
 19      72.6
         ...
 2981    66.2
 2994    66.4
 2996    84.8
 2997    85.7
 2999    68.2
 Name: Performance_Score, Length: 559, dtype: float64,
 10      62.7
 22      76.6
 28      53.2
 29      81.4
 33      69.1
         ...
 2968    73.7
 2980    55.7
 2982    52.8
 2992    72.5
 2995    59.1
 Name: Performance_Score, Length: 448, dtype: float64,
 16      77.4
 17      61.3
 20      62.8
 23      83.9
 31      55.9
         ...
 2948    79.0
 2969    77.7
 2971    66.8
 2988    80.2
 2990    86.2
 Name: Performance_Score, Length: 325, dtype: float64]

In [60]:
f_stat_salary, p_salary = stats.f_oneway(*groups_salary)
print(f"F-statistic: {f_stat_salary:.4f}, p-value: {p_salary:.4f}\n")

F-statistic: 2.2471, p-value: 0.0617

### department and Attrition_Status

In [62]:
contingency = pd.crosstab(df['Department'], df['Attrition_Status'])

chi2_stat, p_val, dof, expected = stats.chi2_contingency(contingency)

print(f"Chi2 Statistic: {chi2_stat:.4f}, P-value: {p_val:.4f}")

if p_val < 0.05:
    print("Reject H₀ → Attrition depends on Gender (significant relationship).\n")
else:
    print("Fail to Reject H₀ → Attrition independent of Gender.\n")

Chi2 Statistic: 1.3287, P-value: 0.8565
Fail to Reject H₀ → Attrition independent of Gender.

In [63]:
contingency

Attrition_Status   No  Yes
Department
Finance           453  106
HR                375   73
IT                885  198
Operations        265   60
Sales             478  107

In [64]:
expected

array([[457.63466667, 101.36533333],
       [366.76266667,  81.23733333],
       [886.616     , 196.384     ],
       [266.06666667,  58.93333333],
       [478.92      , 106.08      ]])

In [65]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### region and salary

In [68]:
groups_salary = [df[df['Region'] == dept]['Salary_INR'] for dept in df['Region'].unique()]

In [69]:
groups_salary

[0        57718
 6        73577
 18       77053
 24       73645
 27       49869
          ...
 2973    106573
 2982     78026
 2986     66433
 2988    110490
 2990    112021
 Name: Salary_INR, Length: 744, dtype: int64,
 1        67381
 4        75717
 8       102801
 10       78826
 11       88931
          ...
 2977     78975
 2978     92512
 2989     71101
 2993     43734
 2996    103344
 Name: Salary_INR, Length: 738, dtype: int64,
 2        61159
 7        48287
 9        63258
 13      101884
 16      123571
          ...
 2984     75493
 2992     76907
 2994     79614
 2997    111769
 2999     96024
 Name: Salary_INR, Length: 752, dtype: int64,
 3        69040
 5        96743
 17       83887
 37       46101
 41      104370
          ...
 2985    113333
 2987     67717
 2991     97837
 2995     82033
 2998     66300
 Name: Salary_INR, Length: 766, dtype: int64]

In [70]:
f_stat_salary, p_salary = stats.f_oneway(*groups_salary)
print(f"F-statistic: {f_stat_salary:.4f}, p-value: {p_salary:.4f}\n")

F-statistic: 0.3272, p-value: 0.8057

### region and performance

In [71]:
groups_salary = [df[df['Region'] == dept]['Performance_Score'] for dept in df['Region'].unique()]

In [72]:
groups_salary

[0       84.1
 6       77.3
 18      77.7
 24      81.6
 27      99.4
         ...
 2973    66.5
 2982    52.8
 2986    83.7
 2988    80.2
 2990    86.2
 Name: Performance_Score, Length: 744, dtype: float64,
 1       47.5
 4       70.2
 8       65.6
 10      62.7
 11      79.5
         ...
 2977    74.4
 2978    56.7
 2989    66.2
 2993    72.9
 2996    84.8
 Name: Performance_Score, Length: 738, dtype: float64,
 2       66.1
 7       69.6
 9       65.1
 13      80.2
 16      77.4
         ...
 2984    50.2
 2992    72.5
 2994    66.4
 2997    85.7
 2999    68.2
 Name: Performance_Score, Length: 752, dtype: float64,
 3       69.5
 5       72.2
 17      61.3
 37      42.0
 41      68.8
         ...
 2985    70.1
 2987    82.4
 2991    81.0
 2995    59.1
 2998    59.4
 Name: Performance_Score, Length: 766, dtype: float64]

In [73]:
f_stat_salary, p_salary = stats.f_oneway(*groups_salary)
print(f"F-statistic: {f_stat_salary:.4f}, p-value: {p_salary:.4f}\n")

F-statistic: 2.2973, p-value: 0.0757

### region and Attrition_Status

In [74]:
contingency = pd.crosstab(df['Region'], df['Attrition_Status'])

chi2_stat, p_val, dof, expected = stats.chi2_contingency(contingency)

print(f"Chi2 Statistic: {chi2_stat:.4f}, P-value: {p_val:.4f}")

if p_val < 0.05:
    print("Reject H₀ → Attrition depends on Gender (significant relationship).\n")
else:
    print("Fail to Reject H₀ → Attrition independent of Gender.\n")

Chi2 Statistic: 2.1121, P-value: 0.5495
Fail to Reject H₀ → Attrition independent of Gender.

In [77]:
contingency

Attrition_Status   No  Yes
Region
Chennai           614  130
Delhi             610  142
Hyderabad         614  124
Pune              618  148

In [75]:
expected

array([[609.088     , 134.912     ],
       [615.63733333, 136.36266667],
       [604.176     , 133.824     ],
       [627.09866667, 138.90133333]])

In [79]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### Experience_Years and salary

In [81]:
from scipy.stats import pearsonr

r, p_val = pearsonr(df['Experience_Years'], df['Salary_INR'])
print(r, p_val)

0.018176829823938433 0.319613093232947

### Experience_Years and Performance_Score

In [82]:
from scipy.stats import pearsonr

r, p_val = pearsonr(df['Experience_Years'], df['Performance_Score'])
print(r, p_val)

-0.02719282610394008 0.1364697112941755

### Experience and Attrition_Status

In [85]:
left = df[df['Attrition_Status']=='Yes']['Experience_Years']

In [86]:
stayed = df[df['Attrition_Status']=='No']['Experience_Years']

In [87]:
t_test,p_value = ttest_ind(left,stayed,equal_var=False)

In [88]:
t_test

0.5577320768030771

In [89]:
p_value

0.5771820834597864

In [90]:
if p_value < 0.05:
    print("Significant difference in Experience between Attrition groups.")
else:
    print("No significant difference in Experience between Attrition groups.")

No significant difference in Experience between Attrition groups.

In [91]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### Education_Level and slary

In [92]:
groups_salary = [df[df['Education_Level'] == dept]['Salary_INR'] for dept in df['Education_Level'].unique()]

In [93]:
groups_salary

[0        57718
 3        69040
 6        73577
 10       78826
 11       88931
          ...
 2991     97837
 2992     76907
 2993     43734
 2994     79614
 2997    111769
 Name: Salary_INR, Length: 989, dtype: int64,
 1        67381
 2        61159
 15       62774
 22      129844
 28       40689
          ...
 2963     75431
 2965     49099
 2977     78975
 2978     92512
 2998     66300
 Name: Salary_INR, Length: 379, dtype: int64,
 4        75717
 5        96743
 7        48287
 8       102801
 9        63258
          ...
 2987     67717
 2990    112021
 2995     82033
 2996    103344
 2999     96024
 Name: Salary_INR, Length: 1632, dtype: int64]

In [94]:
f_stat_salary, p_salary = stats.f_oneway(*groups_salary)
print(f"F-statistic: {f_stat_salary:.4f}, p-value: {p_salary:.4f}\n")

F-statistic: 0.0091, p-value: 0.9909

### Education_Level and  performance

In [95]:
groups_salary = [df[df['Education_Level'] == dept]['Performance_Score'] for dept in df['Education_Level'].unique()]

In [96]:
groups_salary

[0       84.1
 3       69.5
 6       77.3
 10      62.7
 11      79.5
         ...
 2991    81.0
 2992    72.5
 2993    72.9
 2994    66.4
 2997    85.7
 Name: Performance_Score, Length: 989, dtype: float64,
 1       47.5
 2       66.1
 15      63.7
 22      76.6
 28      53.2
         ...
 2963    69.5
 2965    67.6
 2977    74.4
 2978    56.7
 2998    59.4
 Name: Performance_Score, Length: 379, dtype: float64,
 4       70.2
 5       72.2
 7       69.6
 8       65.6
 9       65.1
         ...
 2987    82.4
 2990    86.2
 2995    59.1
 2996    84.8
 2999    68.2
 Name: Performance_Score, Length: 1632, dtype: float64]

In [97]:
f_stat_salary, p_salary = stats.f_oneway(*groups_salary)
print(f"F-statistic: {f_stat_salary:.4f}, p-value: {p_salary:.4f}\n")

F-statistic: 3.4890, p-value: 0.0307

### Education_Level and  atribute_status

In [99]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

In [100]:
contingency = pd.crosstab(df['Education_Level'], df['Attrition_Status'])

chi2_stat, p_val, dof, expected = stats.chi2_contingency(contingency)

print(f"Chi2 Statistic: {chi2_stat:.4f}, P-value: {p_val:.4f}")

if p_val < 0.05:
    print("Reject H₀ → Attrition depends on Gender (significant relationship).\n")
else:
    print("Fail to Reject H₀ → Attrition independent of Gender.\n")

Chi2 Statistic: 0.5985, P-value: 0.7414
Fail to Reject H₀ → Attrition independent of Gender.

In [101]:
contingency

Attrition_Status    No  Yes
Education_Level
1                 1344  288
2                  805  184
3                  307   72

In [102]:
expected

array([[1336.064     ,  295.936     ],
       [ 809.66133333,  179.33866667],
       [ 310.27466667,   68.72533333]])

In [103]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### Training_Hours and salary

In [104]:
from scipy.stats import pearsonr

r, p_val = pearsonr(df['Training_Hours'], df['Salary_INR'])
print(r, p_val)

-0.0007302504081608228 0.968108434514728

### trainig_hours and Performance

In [105]:
from scipy.stats import pearsonr

r, p_val = pearsonr(df['Training_Hours'], df['Performance_Score'])
print(r, p_val)

-0.026598943201019513 0.14524487691179377

### training_hours and attributes

In [108]:
left = df[df['Attrition_Status']=='Yes']['Training_Hours']

In [109]:
stayed = df[df['Attrition_Status']=='No']['Training_Hours']

In [110]:
t_stat, p_value = ttest_ind(left, stayed, equal_var=False)

In [111]:
if p_value < 0.05:
    print("Significant difference in Training Hours between Attrition groups.")
else:
    print("No significant difference in Training Hours between Attrition groups.")

No significant difference in Training Hours between Attrition groups.

In [112]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### Job_Satisfaction_Score and salary_inr

In [113]:
from scipy.stats import pearsonr

r, p_val = pearsonr(df['Job_Satisfaction_Score'], df['Salary_INR'])
print(r, p_val)

0.016154695480972408 0.37641660793012427

### Job_Satisfaction_Score and Performace

In [114]:
from scipy.stats import pearsonr

r, p_val = pearsonr(df['Job_Satisfaction_Score'], df['Performance_Score'])
print(r, p_val)

0.012114849251550638 0.5071349620280399

### jobstisfication and  Attrition_Status

In [115]:
left = df[df['Attrition_Status']=='Yes']['Job_Satisfaction_Score']

In [116]:
stayed = df[df['Attrition_Status']=='No']['Job_Satisfaction_Score']

In [117]:
t_stat, p_value = ttest_ind(left, stayed, equal_var=False)

In [118]:
if p_value < 0.05:
    print("Significant difference in Job_Satisfaction_Score between Attrition groups.")
else:
    print("No significant difference in  Job_Satisfaction_Score between Attrition groups.")

No significant difference in  Job_Satisfaction_Score between Attrition groups.

In [119]:
df.head()

,Employee_ID,Age,Gender,Department,Region,Experience_Years,Education_Level,Salary_INR,Training_Hours,Performance_Score,Job_Satisfaction_Score,Promoted_Last_3_Years,Attrition_Status,Team_ID,Join_Date
0,EMP0001,38,Male,IT,Chennai,0.4,2,57718,42.7,84.1,3.4,Yes,No,T161,2022-01-12
1,EMP0002,34,Female,IT,Hyderabad,4.6,3,67381,45.7,47.5,3.5,No,No,T194,2015-04-11
2,EMP0003,40,Male,IT,Delhi,6.3,3,61159,40.0,66.1,3.6,No,No,T116,2018-01-09
3,EMP0004,46,Female,IT,Pune,15.6,2,69040,15.6,69.5,4.4,No,Yes,T106,2017-06-15
4,EMP0005,33,Female,Sales,Hyderabad,10.2,1,75717,33.4,70.2,2.8,No,Yes,T144,2023-02-06

### Promoted_Last_3_Years and SALARY

In [122]:
promoted = df[df['Promoted_Last_3_Years']=='Yes']['Salary_INR']

In [123]:
NONpromoted = df[df['Promoted_Last_3_Years']=='Yes']['Salary_INR']

In [124]:
t_stat, p_value = ttest_ind(promoted, NONpromoted, equal_var=False)

In [126]:
if p_value < 0.05:
    print("Significant difference in Salary between promoted and non-promoted employees.")
else:
    print("No significant difference in Salary between promoted and non-promoted employees.")

No significant difference in Salary between promoted and non-promoted employees.

### PROMOTED _LAST YEAR AND PERFORMANCE

In [127]:
promoted = df[df['Promoted_Last_3_Years']=='Yes']['Performance_Score']

In [128]:
NONpromoted = df[df['Promoted_Last_3_Years']=='Yes']['Performance_Score']

In [129]:
t_stat, p_value = ttest_ind(promoted, NONpromoted, equal_var=False)

In [131]:
if p_value < 0.05:
    print("Significant difference in Performance_Score between promoted and non-promoted employees.")
else:
    print("No significant difference in Performance_Score between promoted and non-promoted employees.")

No significant difference in Performance_Score between promoted and non-promoted employees.

### PROMOTED _LAST YEAR AND Attrition_Status

In [133]:
contingency = pd.crosstab(df['Promoted_Last_3_Years'], df['Attrition_Status'])

chi2_stat, p_val, dof, expected = stats.chi2_contingency(contingency)

print(f"Chi2 Statistic: {chi2_stat:.4f}, P-value: {p_val:.4f}")

if p_val < 0.05:
    print("Reject H₀ → Attrition depends on Gender (significant relationship).\n")
else:
    print("Fail to Reject H₀ → Attrition independent of Gender.\n")

Chi2 Statistic: 0.8466, P-value: 0.3575
Fail to Reject H₀ → Attrition independent of Gender.